// Task 01
// Що потрапить в консоль ?

let someVar = 0;
++someVar;

if (someVar) {
    //true - умова виконується 
    // інкремент збільшує значення на 1 (0+1)
	console.log(someVar);
    // в консолі виводиться 1
}

// -----------------------------------------------------

// Task 02
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.

let someString = 'Пункт №';

for (let i = 1; i <= 10; i++) {
    console.log(someString + i);
}

// -----------------------------------------------------

// Задача №3
// Що потрапить в консоль ?

if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
    // 2 * 20 <= 10 - false
    // 30 / 2 < 5  && 10 <= "10" - false && true  -  false
    // 20 === "20" - false
    // if( false || false || false)
	console.log('000');
    //умова не виконується, тому в консоль не виведеться нічого
}

// -----------------------------------------------------

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b
//  з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку

function divide(a, b) {
    a = Number(a); // приводимо тип даних до числа
    b = Number(b);
    let result = a / b; // результат ділення
  
    if (!isNaN(a) && !isNaN(b) && isFinite(a) && isFinite(b) && b !== 0) {
      // перевіряємо, що введені дані є числами, скінченними та змінна b не дорівнює 0
      return console.log(`Результат ділення: ${result}`); 
      // виводимо результат в консоль
    }
}

divide(Infinity, 54);
divide(54, Infinity);
divide('string', 54);
divide(54, 'string');
divide(54, '54');
divide(0, 54);
divide(54, '');
divide(54, 0);
divide(0, 0);

// -----------------------------------------------------

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

let myArray = ['10', 123, 'Vasyl', Infinity, 10];

myArray.forEach((elem) => (elem === 10 ? console.log(elem) : null));
// за допомогою методу forEach перебираємо елементи масиву myArray, 
// за допомогою стрілквої функції та тернарного виразу 
// виводимо в консоль елемент масиву, якщо він дорівнює 10

// інший варіант
myArray.forEach((elem) => {
    if (elem === 10) {
        console.log(elem);
    } else {
        null;
    }
})